nhhxhln/Agent-Indicator/firmware/sdkconfig.defaults
# ESP32-S3-WROOM-1-N16R8
CONFIG_IDF_TARGET="esp32s3"

# Flash 16MB / Octal PSRAM 8MB
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y

# 分区表
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# RGB LCD 帧缓冲在 PSRAM,提升带宽稳定性
CONFIG_LCD_RGB_ISR_IRAM_SAFE=y
CONFIG_LCD_RGB_RESTART_IN_VSYNC=y

# WebSocket server(comm_wifi)
CONFIG_HTTPD_WS_SUPPORT=y

# FreeRTOS 1kHz tick,动画引擎用
CONFIG_FREERTOS_HZ=1000

# 控制台/测试 REPL 走 USB Serial/JTAG(GPIO19/20;与 TinyUSB vendor 互斥,
# 量产固件启用 vendor EP 时改回 CDC 控制台)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# LVGL:POSIX 文件系统(盘符 A: 映射 VFS 根,可访问 /spiffs 与 /sdcard)+ TinyTTF
CONFIG_LV_USE_FS_POSIX=y
CONFIG_LV_FS_POSIX_LETTER=65
CONFIG_LV_FS_POSIX_PATH=""
CONFIG_LV_USE_TINY_TTF=y
CONFIG_LV_TINY_TTF_FILE_SUPPORT=y
CONFIG_LV_FONT_MONTSERRAT_20=y
